{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_2","layers":[{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":3,"axis":0}},"bias_constraint":null,"name":"dense_small_1","trainable":true,"batch_input_shape":[null,3094],"dtype":"float32"}},{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":{"class_name":"MaxNorm","config":{"max_value":3,"axis":0}},"bias_constraint":null,"name":"dense_small_2","trainable":true}},{"class_name":"Dense","config":{"units":460,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_small_output","trainable":true}}]},"keras_version":"tfjs-layers 4.13.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.13.0","convertedBy":null,"weightsManifest":[{"paths":["./chatbot_model.weights.bin"],"weights":[{"name":"dense_small_1/kernel","shape":[3094,128],"dtype":"float32"},{"name":"dense_small_1/bias","shape":[128],"dtype":"float32"},{"name":"dense_small_2/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_small_2/bias","shape":[64],"dtype":"float32"},{"name":"dense_small_output/kernel","shape":[64,460],"dtype":"float32"},{"name":"dense_small_output/bias","shape":[460],"dtype":"float32"}]}]}